MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx550f256h.h
extern volatile __RPF11Rbits_t RPF11Rbits __asm__ ("RPF11R") __attribute__((section("sfrs"), address(0xBF80FC6C)));
#define RPF12R RPF12R
extern volatile uint32_t   RPF12R __attribute__((section("sfrs"), address(0xBF80FC70)));
typedef struct {
  uint32_t RPF12R:4;
} __RPF12Rbits_t;
extern volatile __RPF12Rbits_t RPF12Rbits __asm__ ("RPF12R") __attribute__((section("sfrs"), address(0xBF80FC70)));
#define RPF13R RPF13R
extern volatile uint32_t   RPF13R __attribute__((section("sfrs"), address(0xBF80FC74)));
typedef struct {
  uint32_t RPF13R:4;
} __RPF13Rbits_t;
extern volatile __RPF13Rbits_t RPF13Rbits __asm__ ("RPF13R") __attribute__((section("sfrs"), address(0xBF80FC74)));
#define RPF14R RPF14R
extern volatile uint32_t   RPF14R __attribute__((section("sfrs"), address(0xBF80FC78)));
typedef struct {
  uint32_t RPF14R:4;
} __RPF14Rbits_t;
extern volatile __RPF14Rbits_t RPF14Rbits __asm__ ("RPF14R") __attribute__((section("sfrs"), address(0xBF80FC78)));
#define RPF15R RPF15R
extern volatile uint32_t   RPF15R __attribute__((section("sfrs"), address(0xBF80FC7C)));
typedef struct {
  uint32_t RPF15R:4;
} __RPF15Rbits_t;
extern volatile __RPF15Rbits_t RPF15Rbits __asm__ ("RPF15R") __attribute__((section("sfrs"), address(0xBF80FC7C)));
#define RPG0R RPG0R
extern volatile uint32_t   RPG0R __attribute__((section("sfrs"), address(0xBF80FC80)));
typedef struct {
  uint32_t RPG0R:4;
} __RPG0Rbits_t;
extern volatile __RPG0Rbits_t RPG0Rbits __asm__ ("RPG0R") __attribute__((section("sfrs"), address(0xBF80FC80)));
#define RPG1R RPG1R
extern volatile uint32_t   RPG1R __attribute__((section("sfrs"), address(0xBF80FC84)));
typedef struct {
  uint32_t RPG1R:4;
} __RPG1Rbits_t;
extern volatile __RPG1Rbits_t RPG1Rbits __asm__ ("RPG1R") __attribute__((section("sfrs"), address(0xBF80FC84)));
#define RPG2R RPG2R
extern volatile uint32_t   RPG2R __attribute__((section("sfrs"), address(0xBF80FC88)));
typedef struct {
  uint32_t RPG2R:4;
} __RPG2Rbits_t;
extern volatile __RPG2Rbits_t RPG2Rbits __asm__ ("RPG2R") __attribute__((section("sfrs"), address(0xBF80FC88)));
#define RPG3R RPG3R
extern volatile uint32_t   RPG3R __attribute__((section("sfrs"), address(0xBF80FC8C)));
typedef struct {
  uint32_t RPG3R:4;
} __RPG3Rbits_t;
extern volatile __RPG3Rbits_t RPG3Rbits __asm__ ("RPG3R") __attribute__((section("sfrs"), address(0xBF80FC8C)));
#define RPG4R RPG4R
extern volatile uint32_t   RPG4R __attribute__((section("sfrs"), address(0xBF80FC90)));
typedef struct {
  uint32_t RPG4R:4;
} __RPG4Rbits_t;
extern volatile __RPG4Rbits_t RPG4Rbits __asm__ ("RPG4R") __attribute__((section("sfrs"), address(0xBF80FC90)));
#define RPG5R RPG5R
extern volatile uint32_t   RPG5R __attribute__((section("sfrs"), address(0xBF80FC94)));
typedef struct {
  uint32_t RPG5R:4;
} __RPG5Rbits_t;
extern volatile __RPG5Rbits_t RPG5Rbits __asm__ ("RPG5R") __attribute__((section("sfrs"), address(0xBF80FC94)));
#define RPG6R RPG6R
extern volatile uint32_t   RPG6R __attribute__((section("sfrs"), address(0xBF80FC98)));
typedef struct {
  uint32_t RPG6R:4;
} __RPG6Rbits_t;
extern volatile __RPG6Rbits_t RPG6Rbits __asm__ ("RPG6R") __attribute__((section("sfrs"), address(0xBF80FC98)));
#define RPG7R RPG7R
extern volatile uint32_t   RPG7R __attribute__((section("sfrs"), address(0xBF80FC9C)));
typedef struct {
  uint32_t RPG7R:4;
} __RPG7Rbits_t;
extern volatile __RPG7Rbits_t RPG7Rbits __asm__ ("RPG7R") __attribute__((section("sfrs"), address(0xBF80FC9C)));
#define RPG8R RPG8R
extern volatile uint32_t   RPG8R __attribute__((section("sfrs"), address(0xBF80FCA0)));
typedef struct {
  uint32_t RPG8R:4;
} __RPG8Rbits_t;
extern volatile __RPG8Rbits_t RPG8Rbits __asm__ ("RPG8R") __attribute__((section("sfrs"), address(0xBF80FCA0)));
#define RPG9R RPG9R
extern volatile uint32_t   RPG9R __attribute__((section("sfrs"), address(0xBF80FCA4)));
typedef struct {
  uint32_t RPG9R:4;
} __RPG9Rbits_t;
extern volatile __RPG9Rbits_t RPG9Rbits __asm__ ("RPG9R") __attribute__((section("sfrs"), address(0xBF80FCA4)));
#define RPG10R RPG10R
extern volatile uint32_t   RPG10R __attribute__((section("sfrs"), address(0xBF80FCA8)));
typedef struct {
  uint32_t RPG10R:4;
} __RPG10Rbits_t;
extern volatile __RPG10Rbits_t RPG10Rbits __asm__ ("RPG10R") __attribute__((section("sfrs"), address(0xBF80FCA8)));
#define RPG11R RPG11R
extern volatile uint32_t   RPG11R __attribute__((section("sfrs"), address(0xBF80FCAC)));
typedef struct {
  uint32_t RPG11R:4;
} __RPG11Rbits_t;
extern volatile __RPG11Rbits_t RPG11Rbits __asm__ ("RPG11R") __attribute__((section("sfrs"), address(0xBF80FCAC)));
#define RPG12R RPG12R
extern volatile uint32_t   RPG12R __attribute__((section("sfrs"), address(0xBF80FCB0)));
typedef struct {
  uint32_t RPG12R:4;
} __RPG12Rbits_t;
extern volatile __RPG12Rbits_t RPG12Rbits __asm__ ("RPG12R") __attribute__((section("sfrs"), address(0xBF80FCB0)));
#define RPG13R RPG13R
extern volatile uint32_t   RPG13R __attribute__((section("sfrs"), address(0xBF80FCB4)));
typedef struct {
  uint32_t RPG13R:4;
} __RPG13Rbits_t;
extern volatile __RPG13Rbits_t RPG13Rbits __asm__ ("RPG13R") __attribute__((section("sfrs"), address(0xBF80FCB4)));
#define RPG14R RPG14R
extern volatile uint32_t   RPG14R __attribute__((section("sfrs"), address(0xBF80FCB8)));
typedef struct {
  uint32_t RPG14R:4;
} __RPG14Rbits_t;
extern volatile __RPG14Rbits_t RPG14Rbits __asm__ ("RPG14R") __attribute__((section("sfrs"), address(0xBF80FCB8)));
#define RPG15R RPG15R
extern volatile uint32_t   RPG15R __attribute__((section("sfrs"), address(0xBF80FCBC)));
typedef struct {
  uint32_t RPG15R:4;
} __RPG15Rbits_t;
extern volatile __RPG15Rbits_t RPG15Rbits __asm__ ("RPG15R") __attribute__((section("sfrs"), address(0xBF80FCBC)));
#define INTCON INTCON
extern volatile uint32_t   INTCON __attribute__((section("sfrs"), address(0xBF881000)));
typedef union {
  struct {
    uint32_t INT0EP:1;
    uint32_t INT1EP:1;
    uint32_t INT2EP:1;
    uint32_t INT3EP:1;
    uint32_t INT4EP:1;
    uint32_t :3;
    uint32_t TPC:3;
    uint32_t :1;
    uint32_t MVEC:1;
    uint32_t :3;
    uint32_t SS0:1;
  };
  struct {
    uint32_t w:32;
  };
} __INTCONbits_t;
extern volatile __INTCONbits_t INTCONbits __asm__ ("INTCON") __attribute__((section("sfrs"), address(0xBF881000)));
extern volatile uint32_t        INTCONCLR __attribute__((section("sfrs"),address(0xBF881004)));
extern volatile uint32_t        INTCONSET __attribute__((section("sfrs"),address(0xBF881008)));
extern volatile uint32_t        INTCONINV __attribute__((section("sfrs"),address(0xBF88100C)));
#define INTSTAT INTSTAT
extern volatile uint32_t   INTSTAT __attribute__((section("sfrs"), address(0xBF881010)));
typedef struct {
  uint32_t VEC:6;
  uint32_t :2;
  uint32_t SRIPL:3;
} __INTSTATbits_t;
