MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx550f256h.h
extern volatile __C1FLTCON5bits_t C1FLTCON5bits __asm__ ("C1FLTCON5") __attribute__((section("sfrs"), address(0xBF88B110)));
extern volatile uint32_t        C1FLTCON5CLR __attribute__((section("sfrs"),address(0xBF88B114)));
extern volatile uint32_t        C1FLTCON5SET __attribute__((section("sfrs"),address(0xBF88B118)));
extern volatile uint32_t        C1FLTCON5INV __attribute__((section("sfrs"),address(0xBF88B11C)));
#define C1FLTCON6 C1FLTCON6
extern volatile uint32_t   C1FLTCON6 __attribute__((section("sfrs"), address(0xBF88B120)));
typedef union {
  struct {
    uint32_t FSEL24:5;
    uint32_t MSEL24:2;
    uint32_t FLTEN24:1;
    uint32_t FSEL25:5;
    uint32_t MSEL25:2;
    uint32_t FLTEN25:1;
    uint32_t FSEL26:5;
    uint32_t MSEL26:2;
    uint32_t FLTEN26:1;
    uint32_t FSEL27:5;
    uint32_t MSEL27:2;
    uint32_t FLTEN27:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON6bits_t;
extern volatile __C1FLTCON6bits_t C1FLTCON6bits __asm__ ("C1FLTCON6") __attribute__((section("sfrs"), address(0xBF88B120)));
extern volatile uint32_t        C1FLTCON6CLR __attribute__((section("sfrs"),address(0xBF88B124)));
extern volatile uint32_t        C1FLTCON6SET __attribute__((section("sfrs"),address(0xBF88B128)));
extern volatile uint32_t        C1FLTCON6INV __attribute__((section("sfrs"),address(0xBF88B12C)));
#define C1FLTCON7 C1FLTCON7
extern volatile uint32_t   C1FLTCON7 __attribute__((section("sfrs"), address(0xBF88B130)));
typedef union {
  struct {
    uint32_t FSEL28:5;
    uint32_t MSEL28:2;
    uint32_t FLTEN28:1;
    uint32_t FSEL29:5;
    uint32_t MSEL29:2;
    uint32_t FLTEN29:1;
    uint32_t FSEL30:5;
    uint32_t MSEL30:2;
    uint32_t FLTEN30:1;
    uint32_t FSEL31:5;
    uint32_t MSEL31:2;
    uint32_t FLTEN31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON7bits_t;
extern volatile __C1FLTCON7bits_t C1FLTCON7bits __asm__ ("C1FLTCON7") __attribute__((section("sfrs"), address(0xBF88B130)));
extern volatile uint32_t        C1FLTCON7CLR __attribute__((section("sfrs"),address(0xBF88B134)));
extern volatile uint32_t        C1FLTCON7SET __attribute__((section("sfrs"),address(0xBF88B138)));
extern volatile uint32_t        C1FLTCON7INV __attribute__((section("sfrs"),address(0xBF88B13C)));
#define C1RXF0 C1RXF0
extern volatile uint32_t   C1RXF0 __attribute__((section("sfrs"), address(0xBF88B140)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF0bits_t;
extern volatile __C1RXF0bits_t C1RXF0bits __asm__ ("C1RXF0") __attribute__((section("sfrs"), address(0xBF88B140)));
extern volatile uint32_t        C1RXF0CLR __attribute__((section("sfrs"),address(0xBF88B144)));
extern volatile uint32_t        C1RXF0SET __attribute__((section("sfrs"),address(0xBF88B148)));
extern volatile uint32_t        C1RXF0INV __attribute__((section("sfrs"),address(0xBF88B14C)));
#define C1RXF1 C1RXF1
extern volatile uint32_t   C1RXF1 __attribute__((section("sfrs"), address(0xBF88B150)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF1bits_t;
extern volatile __C1RXF1bits_t C1RXF1bits __asm__ ("C1RXF1") __attribute__((section("sfrs"), address(0xBF88B150)));
extern volatile uint32_t        C1RXF1CLR __attribute__((section("sfrs"),address(0xBF88B154)));
extern volatile uint32_t        C1RXF1SET __attribute__((section("sfrs"),address(0xBF88B158)));
extern volatile uint32_t        C1RXF1INV __attribute__((section("sfrs"),address(0xBF88B15C)));
#define C1RXF2 C1RXF2
extern volatile uint32_t   C1RXF2 __attribute__((section("sfrs"), address(0xBF88B160)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF2bits_t;
extern volatile __C1RXF2bits_t C1RXF2bits __asm__ ("C1RXF2") __attribute__((section("sfrs"), address(0xBF88B160)));
extern volatile uint32_t        C1RXF2CLR __attribute__((section("sfrs"),address(0xBF88B164)));
extern volatile uint32_t        C1RXF2SET __attribute__((section("sfrs"),address(0xBF88B168)));
extern volatile uint32_t        C1RXF2INV __attribute__((section("sfrs"),address(0xBF88B16C)));
#define C1RXF3 C1RXF3
extern volatile uint32_t   C1RXF3 __attribute__((section("sfrs"), address(0xBF88B170)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF3bits_t;
extern volatile __C1RXF3bits_t C1RXF3bits __asm__ ("C1RXF3") __attribute__((section("sfrs"), address(0xBF88B170)));
extern volatile uint32_t        C1RXF3CLR __attribute__((section("sfrs"),address(0xBF88B174)));
extern volatile uint32_t        C1RXF3SET __attribute__((section("sfrs"),address(0xBF88B178)));
extern volatile uint32_t        C1RXF3INV __attribute__((section("sfrs"),address(0xBF88B17C)));
#define C1RXF4 C1RXF4
extern volatile uint32_t   C1RXF4 __attribute__((section("sfrs"), address(0xBF88B180)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF4bits_t;
extern volatile __C1RXF4bits_t C1RXF4bits __asm__ ("C1RXF4") __attribute__((section("sfrs"), address(0xBF88B180)));
extern volatile uint32_t        C1RXF4CLR __attribute__((section("sfrs"),address(0xBF88B184)));
extern volatile uint32_t        C1RXF4SET __attribute__((section("sfrs"),address(0xBF88B188)));
extern volatile uint32_t        C1RXF4INV __attribute__((section("sfrs"),address(0xBF88B18C)));
#define C1RXF5 C1RXF5
extern volatile uint32_t   C1RXF5 __attribute__((section("sfrs"), address(0xBF88B190)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF5bits_t;
extern volatile __C1RXF5bits_t C1RXF5bits __asm__ ("C1RXF5") __attribute__((section("sfrs"), address(0xBF88B190)));
extern volatile uint32_t        C1RXF5CLR __attribute__((section("sfrs"),address(0xBF88B194)));
extern volatile uint32_t        C1RXF5SET __attribute__((section("sfrs"),address(0xBF88B198)));
extern volatile uint32_t        C1RXF5INV __attribute__((section("sfrs"),address(0xBF88B19C)));
#define C1RXF6 C1RXF6
extern volatile uint32_t   C1RXF6 __attribute__((section("sfrs"), address(0xBF88B1A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF6bits_t;
extern volatile __C1RXF6bits_t C1RXF6bits __asm__ ("C1RXF6") __attribute__((section("sfrs"), address(0xBF88B1A0)));
extern volatile uint32_t        C1RXF6CLR __attribute__((section("sfrs"),address(0xBF88B1A4)));
extern volatile uint32_t        C1RXF6SET __attribute__((section("sfrs"),address(0xBF88B1A8)));
extern volatile uint32_t        C1RXF6INV __attribute__((section("sfrs"),address(0xBF88B1AC)));
#define C1RXF7 C1RXF7
extern volatile uint32_t   C1RXF7 __attribute__((section("sfrs"), address(0xBF88B1B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF7bits_t;
extern volatile __C1RXF7bits_t C1RXF7bits __asm__ ("C1RXF7") __attribute__((section("sfrs"), address(0xBF88B1B0)));
extern volatile uint32_t        C1RXF7CLR __attribute__((section("sfrs"),address(0xBF88B1B4)));
extern volatile uint32_t        C1RXF7SET __attribute__((section("sfrs"),address(0xBF88B1B8)));
extern volatile uint32_t        C1RXF7INV __attribute__((section("sfrs"),address(0xBF88B1BC)));
#define C1RXF8 C1RXF8
extern volatile uint32_t   C1RXF8 __attribute__((section("sfrs"), address(0xBF88B1C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF8bits_t;
extern volatile __C1RXF8bits_t C1RXF8bits __asm__ ("C1RXF8") __attribute__((section("sfrs"), address(0xBF88B1C0)));
extern volatile uint32_t        C1RXF8CLR __attribute__((section("sfrs"),address(0xBF88B1C4)));
extern volatile uint32_t        C1RXF8SET __attribute__((section("sfrs"),address(0xBF88B1C8)));
extern volatile uint32_t        C1RXF8INV __attribute__((section("sfrs"),address(0xBF88B1CC)));
#define C1RXF9 C1RXF9
extern volatile uint32_t   C1RXF9 __attribute__((section("sfrs"), address(0xBF88B1D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF9bits_t;
extern volatile __C1RXF9bits_t C1RXF9bits __asm__ ("C1RXF9") __attribute__((section("sfrs"), address(0xBF88B1D0)));
extern volatile uint32_t        C1RXF9CLR __attribute__((section("sfrs"),address(0xBF88B1D4)));
extern volatile uint32_t        C1RXF9SET __attribute__((section("sfrs"),address(0xBF88B1D8)));
extern volatile uint32_t        C1RXF9INV __attribute__((section("sfrs"),address(0xBF88B1DC)));
#define C1RXF10 C1RXF10
extern volatile uint32_t   C1RXF10 __attribute__((section("sfrs"), address(0xBF88B1E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF10bits_t;
extern volatile __C1RXF10bits_t C1RXF10bits __asm__ ("C1RXF10") __attribute__((section("sfrs"), address(0xBF88B1E0)));
extern volatile uint32_t        C1RXF10CLR __attribute__((section("sfrs"),address(0xBF88B1E4)));
extern volatile uint32_t        C1RXF10SET __attribute__((section("sfrs"),address(0xBF88B1E8)));
extern volatile uint32_t        C1RXF10INV __attribute__((section("sfrs"),address(0xBF88B1EC)));
#define C1RXF11 C1RXF11
extern volatile uint32_t   C1RXF11 __attribute__((section("sfrs"), address(0xBF88B1F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF11bits_t;
extern volatile __C1RXF11bits_t C1RXF11bits __asm__ ("C1RXF11") __attribute__((section("sfrs"), address(0xBF88B1F0)));
extern volatile uint32_t        C1RXF11CLR __attribute__((section("sfrs"),address(0xBF88B1F4)));
extern volatile uint32_t        C1RXF11SET __attribute__((section("sfrs"),address(0xBF88B1F8)));
extern volatile uint32_t        C1RXF11INV __attribute__((section("sfrs"),address(0xBF88B1FC)));
#define C1RXF12 C1RXF12
extern volatile uint32_t   C1RXF12 __attribute__((section("sfrs"), address(0xBF88B200)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF12bits_t;
extern volatile __C1RXF12bits_t C1RXF12bits __asm__ ("C1RXF12") __attribute__((section("sfrs"), address(0xBF88B200)));
extern volatile uint32_t        C1RXF12CLR __attribute__((section("sfrs"),address(0xBF88B204)));
extern volatile uint32_t        C1RXF12SET __attribute__((section("sfrs"),address(0xBF88B208)));
extern volatile uint32_t        C1RXF12INV __attribute__((section("sfrs"),address(0xBF88B20C)));
#define C1RXF13 C1RXF13
extern volatile uint32_t   C1RXF13 __attribute__((section("sfrs"), address(0xBF88B210)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF13bits_t;
extern volatile __C1RXF13bits_t C1RXF13bits __asm__ ("C1RXF13") __attribute__((section("sfrs"), address(0xBF88B210)));
extern volatile uint32_t        C1RXF13CLR __attribute__((section("sfrs"),address(0xBF88B214)));
extern volatile uint32_t        C1RXF13SET __attribute__((section("sfrs"),address(0xBF88B218)));
extern volatile uint32_t        C1RXF13INV __attribute__((section("sfrs"),address(0xBF88B21C)));
#define C1RXF14 C1RXF14
extern volatile uint32_t   C1RXF14 __attribute__((section("sfrs"), address(0xBF88B220)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF14bits_t;
extern volatile __C1RXF14bits_t C1RXF14bits __asm__ ("C1RXF14") __attribute__((section("sfrs"), address(0xBF88B220)));
extern volatile uint32_t        C1RXF14CLR __attribute__((section("sfrs"),address(0xBF88B224)));
extern volatile uint32_t        C1RXF14SET __attribute__((section("sfrs"),address(0xBF88B228)));
extern volatile uint32_t        C1RXF14INV __attribute__((section("sfrs"),address(0xBF88B22C)));
#define C1RXF15 C1RXF15
extern volatile uint32_t   C1RXF15 __attribute__((section("sfrs"), address(0xBF88B230)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF15bits_t;
